app/controllers/appointments_controller.rb

  def show
    @infos = @appointment.infos

    @inviting_user = @appointment.inviting_users
    @search_users = User.search(params[:s_nickname])
---
SELECT "users".* FROM "users" WHERE (nickname like '%s%')

  def create
    @appointment = Appointment.new(appointment_params)
    @appointment.app_type = params[:app_type]
    @app_type = @appointment.app_type

    if @appointment.save
---
INSERT INTO "appointments" ("title", "content", "deadline", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["deadline", "2017-07-31 12:00:00"], ["type", "MoneyApp"], ["created_at", "2017-07-30 06:09:19.615869"], ["updated_at", "2017-07-30 06:09:19.615869"]]

  def set_appointment
    @appointment = Appointment.find(params[:id])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."type" IN ('MoneyApp') AND "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_info
    Info.create(user_id: current_user.id,
                appointment_id: @appointment.id,
                builder: true)
---
INSERT INTO "infos" ("user_id", "appointment_id", "builder", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["appointment_id", 3], ["builder", "t"], ["created_at", "2017-07-30 06:11:20.181995"], ["updated_at", "2017-07-30 06:11:20.181995"]]