app/controllers/infos_controller.rb

  def create
    @notification = Notification.find(params[:notification_id])
    @user = @notification.user
    @info = @user.infos.new(appointment_id: @notification.appointment_id)
    @appointment = @info.appointment

    if @notification.destroy && @info.save
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."type" IN ('AppNote') AND "notifications"."id" = ?  [["id", 1]]
INSERT INTO "infos" ("user_id", "appointment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["appointment_id", 1], ["created_at", "2017-07-30 07:33:41.861907"], ["updated_at", "2017-07-30 07:33:41.861907"]]

  def done
    @info.done = true
    @info.save
---
UPDATE "infos" SET "done" = ?, "updated_at" = ? WHERE "infos"."id" = ?  [["done", "t"], ["updated_at", "2017-07-30 07:49:59.981789"], ["id", 1]]

  def set_info
    @info = Info.find(params[:id])
---
SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]