app/controllers/money_apps_controller.rb

  def show
    @users = @money_app.users
    @infos = @money_app.money_infos

    @search_users = User.search(params[:s_nickname])
---
SELECT "users".* FROM "users" WHERE (nickname like '%ㅇ%')

  def create
    @money_app = MoneyApp.new(money_params)
    @money_app.save
---
INSERT INTO "money_apps" ("title", "content", "deadline", "total_money", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["deadline", "2017-07-18 00:00:00"], ["total_money", 10000], ["created_at", "2017-07-15 16:22:29.115735"], ["updated_at", "2017-07-15 16:22:29.115735"]]

  def destroy
    @money_app.destroy
---
DELETE FROM "money_apps" WHERE "money_apps"."id" = ?  [["id", 4]]

  def set_money_app
    @money_app = MoneyApp.find(params[:id])
---
SELECT  "money_apps".* FROM "money_apps" WHERE "money_apps"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]