app/controllers/notifications_controller.rb

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notifications" ("user_id", "requester_id", "appointment_id", "type", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

    case params[:type]
      when 'AppNote'
        appointment = Appointment.find(params[:appointment_id])
        app_notification = AppNote.new(appointment_id: appointment.id,
                                       user_id: params[:user_id],
                                       requester_id: current_user.id)
        app_notification.message = "<em>" + appointment.title + "</em>" + "에 초대되셨습니다!"
        app_notification.save

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."type" IN ('AppNote') AND "notifications"."id" = ?  [["id", 2]]
---
  def destroy
    @notification = Notification.find(params[:id])

    if @notification.destroy